alplabai/alp-sdk/examples/v2n/v2n-gd32-bridge-hil-soak/src/main.c
/*
 * Copyright 2026 Alp Lab AB
 * SPDX-License-Identifier: Apache-2.0
 *
 * v2n-gd32-bridge-hil-soak — pass/fail soak of the WHOLE GD32 bridge
 * command set over the 25 MHz SPI fast path.
 *
 * Where v2n-gd32-bridge-ping proves the link (PING + GET_VERSION),
 * this example proves the COMMAND SET: every opcode the bridge
 * firmware implements is exercised each cycle with a self-contained
 * verification (readback compare, range sanity, monotonicity, or a
 * documented-sentinel assert) — no external instruments needed.
 * Scope tests (PWM waveform shape, ADC absolute accuracy) stay in
 * the HIL-PLAN instrument rows; this soak is the "does every opcode
 * round-trip and tell the truth" layer underneath them.
 *
 * The mix deliberately stresses the 25 MHz framing: PING is a 4-byte
 * (even) reply, GET_VERSION 7 bytes (odd), ADC_STREAM_READ up to
 * 1 + 2*N bytes — so both parities and long frames hit the GD32's
 * DMA reply path every cycle (the odd-length FIFO-residue failure
 * class is what the byte-access reply fix addressed).
 *
 * Pass/fail accounting: each test bumps a per-test pass or fail
 * counter and the soak NEVER halts on failure — a soak's job is to
 * count, recover, and keep hammering.  A cycle summary prints every
 * cycle and a cumulative table every 16 cycles; any FAIL line carries
 * the alp_status_t so a console log alone is diagnosable.
 */

#include <stdio.h>
#include <string.h>

#include <zephyr/kernel.h>

#include "alp/peripheral.h"
#include "alp/chips/gd32g553.h"

/* ------------------------------------------------------------------ */
/* Soak bookkeeping                                                    */
/* ------------------------------------------------------------------ */

typedef struct {
    const char *name;
    uint32_t    pass;
    uint32_t    fail;
    int         last_status;   /* last failing alp_status_t (0 if none) */
} soak_stat_t;

/* One context for the whole soak; opened once, recovered on demand. */
static gd32g553_t ctx;

/* Version captured at init -- GET_VERSION must keep matching it
 * (a mid-soak change would mean the GD32 silently rebooted). */
static gd32g553_version_t boot_version;

/* Build-id captured on the first successful read -- must stay
 * constant for the same reason. */
static char boot_build_id[GD32G553_BUILD_ID_LEN + 1];
static bool boot_build_id_valid;

/* FAIL printf helper: one line per failure, with the status code,
 * so a UART capture alone localises the broken opcode. */
#define SOAK_FAIL(st, fmt, ...)                                         \
    printf("[hil-soak] FAIL %s: " fmt "\n", st->name, ##__VA_ARGS__)

static bool float_near(float a, float b, float tol)
{
    const float d = (a > b) ? (a - b) : (b - a);
    return d <= tol;
}

/* ------------------------------------------------------------------ */
/* Per-opcode tests.  Each returns true on pass and logs on failure.   */
/* ------------------------------------------------------------------ */

/* 0x00 PING -- 4-byte (even-parity) reply envelope. */
static bool t_ping(soak_stat_t *st)
{
    const alp_status_t s = gd32g553_ping_via(&ctx, GD32G553_TRANSPORT_SPI);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "status=%d", (int)s); return false; }
    return true;
}

/* 0x01 GET_VERSION -- 7-byte (odd-parity) reply; must match the
 * version read at init (a change = the GD32 rebooted mid-soak). */
static bool t_get_version(soak_stat_t *st)
{
    gd32g553_version_t v = {0};
    const alp_status_t s = gd32g553_get_version(&ctx, &v);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "status=%d", (int)s); return false; }
    if (v.major != boot_version.major || v.minor != boot_version.minor ||
        v.patch != boot_version.patch) {
        SOAK_FAIL(st, "version changed mid-soak: v%u.%u.%u (boot v%u.%u.%u)",
                  v.major, v.minor, v.patch,
                  boot_version.major, boot_version.minor, boot_version.patch);
        return false;
    }
    return true;
}

/* 0x02 GET_BUILD_ID -- non-empty, NUL-terminated, constant. */
static bool t_get_build_id(soak_stat_t *st)
{
    char id[GD32G553_BUILD_ID_LEN + 1] = {0};
    const alp_status_t s = gd32g553_get_build_id(&ctx, id);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "status=%d", (int)s); return false; }
    if (id[0] == '\0') { SOAK_FAIL(st, "empty build-id"); return false; }
    if (!boot_build_id_valid) {
        memcpy(boot_build_id, id, sizeof boot_build_id);
        boot_build_id_valid = true;
        printf("[hil-soak] firmware build-id: %s\n", id);
    } else if (strncmp(id, boot_build_id, GD32G553_BUILD_ID_LEN) != 0) {
        SOAK_FAIL(st, "build-id changed mid-soak: %s (boot %s)", id, boot_build_id);
        return false;
    }
    return true;
}

/* 0x03 RESET_REASON -- any in-range cause passes; logged once so a
 * cold-boot run shows POWER_ON and a watchdog event shows WDT. */
static bool t_reset_reason(soak_stat_t *st)
{
    gd32g553_reset_cause_t cause;
    const alp_status_t s = gd32g553_get_reset_reason(&ctx, &cause);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "status=%d", (int)s); return false; }
    if (cause > GD32G553_RESET_LOWPOWER) {
        SOAK_FAIL(st, "out-of-range cause %d", (int)cause);
        return false;
    }
    return true;
}

/* 0x10/0x11 GPIO_READ + GPIO_WRITE.  mask=0 makes the write a
 * provable no-op (atomically changes nothing) while still pushing the
 * full request/decode/dispatch path through the wire -- the soak must
 * not flip real supervisor pads (camera LDOs, REG_ONs, SE_RST live
 * on this map). */
static bool t_gpio(soak_stat_t *st)
{
    uint32_t levels = 0;
    alp_status_t s = gd32g553_gpio_read(&ctx, 0xFFFFFFFFu, &levels);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "read status=%d", (int)s); return false; }
    s = gd32g553_gpio_write(&ctx, 0u, 0u);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "write status=%d", (int)s); return false; }
    return true;
}

/* 0x20/0x21 PWM_SET + PWM_GET readback.  1 kHz / 25 % on PWM0
 * (TIMER0_MCH0, GD32 pad PA11 -> an unloaded E1M edge pin on the
 * bench).  The firmware rounds to its ~4.16 ns tick, so the readback
 * compare allows 1 % -- far above rounding, far below a real bug.
 * Duty returns to 0 afterwards so the pad idles low between cycles. */
static bool t_pwm_set_get(soak_stat_t *st)
{
    const uint32_t period = 1000000u;   /* 1 ms */
    const uint32_t duty   = 250000u;    /* 25 % */
    uint32_t rp = 0, rd = 0;
    alp_status_t s = gd32g553_pwm_set(&ctx, 0u, period, duty);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "set status=%d", (int)s); return false; }
    s = gd32g553_pwm_get(&ctx, 0u, &rp, &rd);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "get status=%d", (int)s); return false; }
    const bool ok = (rp > period - period / 100u) && (rp < period + period / 100u) &&
                    (rd > duty - duty / 100u) && (rd < duty + duty / 100u);
    if (!ok) {
        SOAK_FAIL(st, "readback %u/%u ns (wrote %u/%u)", rp, rd, period, duty);
    }
    (void)gd32g553_pwm_set(&ctx, 0u, period, 0u);   /* park the pad low */
    return ok;
}

/* 0x26 PWM_SINGLE_PULSE -- one 1 us one-shot on PWM1.  Status-only
 * here; the pulse itself is a scope row in the HIL-PLAN. */
static bool t_pwm_single_pulse(soak_stat_t *st)
{
    const alp_status_t s = gd32g553_pwm_single_pulse(&ctx, 1u, 1000u);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "status=%d", (int)s); return false; }
    return true;
}

/* 0x23/0x24/0x25 PWM capture begin/read/end on PWM2.  Nothing drives
 * the pad on the bench, so READ legitimately reports "no edges yet"
 * -- the firmware maps an empty capture ring to NOSUPPORT today (the
 * input pad routing is a known follow-up), so OK and NOSUPPORT both
 * pass; any other status (or a failing begin/end) is a real fault. */
static bool t_pwm_capture(soak_stat_t *st)
{
    alp_status_t s = gd32g553_pwm_capture_begin(&ctx, 2u, 2u /* both edges */);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "begin status=%d", (int)s); return false; }
    uint32_t period = 0, pulse = 0;
    s = gd32g553_pwm_capture_read(&ctx, 2u, &period, &pulse);
    if (s != ALP_OK && s != ALP_ERR_NOSUPPORT) {
        st->last_status = (int)s;
        SOAK_FAIL(st, "read status=%d", (int)s);
        (void)gd32g553_pwm_capture_end(&ctx, 2u);
        return false;
    }
    s = gd32g553_pwm_capture_end(&ctx, 2u);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "end status=%d", (int)s); return false; }
    return true;
}

/* 0x30 ADC_READ -- 4 firmware-averaged samples off E1M ADC0.  The
 * pad floats on the bench so any value is "right"; the assert is the
 * physical ceiling (VREF 3.3 V) plus a successful 4-sample reply. */
static bool t_adc_read(soak_stat_t *st)
{
    uint16_t mv[4] = {0};
    const alp_status_t s = gd32g553_adc_read(&ctx, 0u, 4u, mv);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "status=%d", (int)s); return false; }
    for (unsigned i = 0; i < 4u; ++i) {
        if (mv[i] > 3400u) { SOAK_FAIL(st, "sample %u = %u mV > VREF", i, mv[i]); return false; }
    }
    return true;
}

