alplabai/alp-sdk/examples/v2n/v2n-gd32-bridge-hil-soak/src/main.c
/* 0x33/0x34/0x35 ADC stream -- THE regression test for the
 * stream-DMA DMAMUX fix (dma_parameter_struct.request was never set,
 * so the channel triggered off a garbage request id and the ring
 * never filled).  1 kHz for ~50 ms must yield a full 32-sample read;
 * zero samples here means the DMA regressed. */
static bool t_adc_stream(soak_stat_t *st)
{
    alp_status_t s = gd32g553_adc_stream_begin(&ctx, 0u, 0u, 1000u);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "begin status=%d", (int)s); return false; }

    k_msleep(50);   /* ~50 samples into the 1024-deep ring at 1 kHz */

    uint8_t  got = 0;
    uint16_t mv[32] = {0};
    s = gd32g553_adc_stream_read(&ctx, 0u, 32u, &got, mv);
    const alp_status_t s_end = gd32g553_adc_stream_end(&ctx, 0u);

    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "read status=%d", (int)s); return false; }
    if (got == 0u) {
        SOAK_FAIL(st, "0 samples after 50 ms @1 kHz -- stream DMA not filling (DMAMUX request id?)");
        return false;
    }
    if (s_end != ALP_OK) { st->last_status = (int)s_end; SOAK_FAIL(st, "end status=%d", (int)s_end); return false; }
    return true;
}

/* 0x50/0x51 DAC_SET + DAC_GET readback at mid-rail.  12-bit DAC off
 * 3.3 V is ~0.8 mV/LSB; ±16 mV of tolerance covers rounding plus a
 * generous firmware-side conversion slack.  Returns the pad to 0 mV
 * so the bench pin idles between cycles. */
static bool t_dac(soak_stat_t *st)
{
    uint16_t rb = 0;
    alp_status_t s = gd32g553_dac_set(&ctx, 0u, 1650u);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "set status=%d", (int)s); return false; }
    s = gd32g553_dac_get(&ctx, 0u, &rb);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "get status=%d", (int)s); return false; }
    const bool ok = (rb >= 1650u - 16u) && (rb <= 1650u + 16u);
    if (!ok) { SOAK_FAIL(st, "readback %u mV (wrote 1650)", rb); }
    (void)gd32g553_dac_set(&ctx, 0u, 0u);
    return ok;
}

/* 0x60/0x61 QENC reset + read.  No encoder turns on the bench, so a
 * freshly-reset count must read back exactly 0. */
static bool t_qenc(soak_stat_t *st)
{
    alp_status_t s = gd32g553_qenc_reset(&ctx, 0u);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "reset status=%d", (int)s); return false; }
    int32_t pos = -1;
    s = gd32g553_qenc_read(&ctx, 0u, &pos);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "read status=%d", (int)s); return false; }
    if (pos != 0) { SOAK_FAIL(st, "position %d after reset (no encoder attached)", (int)pos); return false; }
    return true;
}

/* 0x70 COUNTER_READ -- the GD32's DWT cycle counter; two reads a few
 * hundred microseconds apart must be strictly increasing (modulo a
 * 32-bit wrap, which at 216 MHz comes every ~19.9 s -- one spurious
 * fail per wrap window is acceptable soak noise and shows up as a
 * lone count, not a streak). */
static bool t_counter(soak_stat_t *st)
{
    uint32_t a = 0, b = 0;
    alp_status_t s = gd32g553_counter_read(&ctx, 0u, &a);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "status=%d", (int)s); return false; }
    k_busy_wait(200);
    s = gd32g553_counter_read(&ctx, 0u, &b);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "status=%d", (int)s); return false; }
    if (b == a) { SOAK_FAIL(st, "counter frozen at %u", a); return false; }
    return true;
}

/* 0x80 TRNG_READ -- two 16-byte pulls: each must be non-constant and
 * the two must differ.  (A statistical health test is the silicon
 * TRNG's own SP800-90B logic; the soak just proves entropy flows.) */
static bool t_trng(soak_stat_t *st)
{
    uint8_t a[16] = {0}, b[16] = {0};
    alp_status_t s = gd32g553_trng_read(&ctx, a, sizeof a);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "status=%d", (int)s); return false; }
    s = gd32g553_trng_read(&ctx, b, sizeof b);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "status=%d", (int)s); return false; }
    bool constant = true;
    for (unsigned i = 1; i < sizeof a; ++i) {
        if (a[i] != a[0]) { constant = false; break; }
    }
    if (constant) { SOAK_FAIL(st, "16-byte pull is constant 0x%02X", a[0]); return false; }
    if (memcmp(a, b, sizeof a) == 0) { SOAK_FAIL(st, "two pulls identical"); return false; }
    return true;
}

/* 0x90 TMU_COMPUTE -- CORDIC sqrt(4.0f) must come back 2.0f (the
 * answer is exact in binary32, so the 1e-3 tolerance only absorbs
 * CORDIC iteration error), plus sin(0) == 0. */
static bool t_tmu(soak_stat_t *st)
{
    float in = 4.0f, out = 0.0f;
    uint32_t in_bits, out_bits = 0;
    memcpy(&in_bits, &in, sizeof in_bits);
    alp_status_t s = gd32g553_tmu_compute(&ctx, GD32G553_TMU_FN_SQRT,
                                          GD32G553_TMU_FMT_F32, in_bits, 0u, &out_bits);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "sqrt status=%d", (int)s); return false; }
    memcpy(&out, &out_bits, sizeof out);
    if (!float_near(out, 2.0f, 1e-3f)) {
        SOAK_FAIL(st, "sqrt(4.0) = %d/1000 (want 2000/1000)", (int)(out * 1000.0f));
        return false;
    }
    s = gd32g553_tmu_compute(&ctx, GD32G553_TMU_FN_SIN, GD32G553_TMU_FMT_F32, 0u, 0u, &out_bits);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "sin status=%d", (int)s); return false; }
    memcpy(&out, &out_bits, sizeof out);
    if (!float_near(out, 0.0f, 1e-3f)) {
        SOAK_FAIL(st, "sin(0) = %d/1000 (want 0)", (int)(out * 1000.0f));
        return false;
    }
    return true;
}

/* 0x27 TIMER_SYNC -- link TIMER0 (master) -> TIMER7 (slave, restart
 * mode) and immediately unlink (mode 0).  Runs AFTER the PWM tests in
 * the table: while linked, TIMER7's PWM4..7 phase-restart on TIMER0's
 * update -- harmless on unloaded bench pads, but keep the window
 * short and always restore the timers to independent free-run. */
static bool t_timer_sync(soak_stat_t *st)
{
    alp_status_t s = gd32g553_timer_sync(&ctx, 0u, 1u, 1u /* restart */);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "link status=%d", (int)s); return false; }
    s = gd32g553_timer_sync(&ctx, 0u, 1u, 0u /* disable */);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "unlink status=%d", (int)s); return false; }
    return true;
}

/* 0x28 POWER_MODE_SET -- mode 0 ("run") is the documented no-op
 * request: it exercises the full opcode path without putting either
 * SoC to sleep mid-soak.  The real sleep/wake transitions are their
 * own HIL rows (they tear down this very link). */
static bool t_power_mode(soak_stat_t *st)
{
    const alp_status_t s = gd32g553_power_mode_set(&ctx, 0u, 0u, 0u);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "status=%d", (int)s); return false; }
    return true;
}

/* 0x40 DA9292_STATUS_FORWARD -- on THIS SoM revision the DA9292
 * fault nets reach only the Renesas (P37/P36); the GD32 has no pin to
 * sample, so the contract says the reply is the 0xFF "no sample"
 * sentinel, always.  Anything else = firmware drifted from the wire
 * contract (or someone wired a new HW rev without updating it). */
static bool t_da9292_sentinel(soak_stat_t *st)
{
    uint8_t v = 0;
    const alp_status_t s = gd32g553_da9292_status_forward(&ctx, &v);
    if (s != ALP_OK) { st->last_status = (int)s; SOAK_FAIL(st, "status=%d", (int)s); return false; }
    if (v != 0xFFu) { SOAK_FAIL(st, "0x%02X (this HW rev must answer the 0xFF sentinel)", v); return false; }
    return true;
}

/* 0xF5 OTA_GET_STATE -- proves the 0xF0.. dispatch range routes
 * correctly without arming anything destructive.  Both deployments
 * pass: the UNARMED build answers NOSUPPORT for the whole OTA range;
 * the ARMED (partitioned) build answers a concrete, sane state
 * snapshot.  Anything else is a dispatch fault.  (The armed OTA
 * flow itself has its own dedicated bench procedure.) */
static bool t_ota_get_state(soak_stat_t *st)
{
    gd32g553_ota_state_info_t info;
    const alp_status_t s = gd32g553_ota_get_state(&ctx, &info);
    if (s == ALP_ERR_NOSUPPORT) {
        return true;                      /* unarmed build: documented reply */
    }
    if (s != ALP_OK) {
        st->last_status = (int)s;
        SOAK_FAIL(st, "status=%d (want OK or NOSUPPORT)", (int)s);
        return false;
    }
    if (info.state > GD32G553_OTA_STATE_ERROR ||
        (info.active_slot != GD32G553_OTA_SLOT_A &&
         info.active_slot != GD32G553_OTA_SLOT_B)) {
        SOAK_FAIL(st, "armed build, insane snapshot: state=%d active=%d",
                  (int)info.state, (int)info.active_slot);
        return false;
    }
    return true;
}

