alplabai/alp-sdk/examples/v2n/v2n-gd32-bridge-hil-soak/src/main.c
/* ------------------------------------------------------------------ */
/* Test table -- cycle order matters: PWM readbacks run before        */
/* TIMER_SYNC briefly links their timers.                              */
/* ------------------------------------------------------------------ */

typedef bool (*soak_fn_t)(soak_stat_t *st);

static struct {
    soak_stat_t stat;
    soak_fn_t   fn;
} tests[] = {
    { { "ping",             0, 0, 0 }, t_ping             },
    { { "get_version",      0, 0, 0 }, t_get_version      },
    { { "get_build_id",     0, 0, 0 }, t_get_build_id     },
    { { "reset_reason",     0, 0, 0 }, t_reset_reason     },
    { { "gpio",             0, 0, 0 }, t_gpio             },
    { { "pwm_set_get",      0, 0, 0 }, t_pwm_set_get      },
    { { "pwm_single_pulse", 0, 0, 0 }, t_pwm_single_pulse },
    { { "pwm_capture",      0, 0, 0 }, t_pwm_capture      },
    { { "adc_read",         0, 0, 0 }, t_adc_read         },
    { { "adc_stream",       0, 0, 0 }, t_adc_stream       },
    { { "dac",              0, 0, 0 }, t_dac              },
    { { "qenc",             0, 0, 0 }, t_qenc             },
    { { "counter",          0, 0, 0 }, t_counter          },
    { { "trng",             0, 0, 0 }, t_trng             },
    { { "tmu",              0, 0, 0 }, t_tmu              },
    { { "timer_sync",       0, 0, 0 }, t_timer_sync       },
    { { "power_mode",       0, 0, 0 }, t_power_mode       },
    { { "da9292_sentinel",  0, 0, 0 }, t_da9292_sentinel  },
    { { "ota_get_state",    0, 0, 0 }, t_ota_get_state    },
};

#define SOAK_TEST_COUNT (sizeof tests / sizeof tests[0])

/* ------------------------------------------------------------------ */
/* Link bring-up + recovery                                            */
/* ------------------------------------------------------------------ */

/* Same cold-boot-autonomous retry as the ping example: the CM33
 * system-manager starts before the GD32 finishes power-on (shared
 * PMIC reset-out), so init retries until the GD32 answers -- no fixed
 * boot delay anywhere. */
static void link_init_blocking(alp_spi_t *spi)
{
    unsigned attempt = 0;
    alp_status_t s;
    do {
        s = gd32g553_init(&ctx, spi, NULL, GD32G553_BRIDGE_DEFAULT_I2C_ADDR);
        if (s != ALP_OK) {
            printf("[hil-soak] init attempt %u failed: %d -- retrying in 200 ms\n",
                   attempt++, (int)s);
            k_msleep(200);
        }
    } while (s != ALP_OK);
    boot_version = ctx.version;
    printf("[hil-soak] link up after %u retr%s; firmware v%u.%u.%u\n",
           attempt, (attempt == 1u) ? "y" : "ies",
           boot_version.major, boot_version.minor, boot_version.patch);
}

int main(void)
{
    printf("[hil-soak] V2N GD32 bridge full-command-set soak (25 MHz SPI)\n");

    /* 25 MHz SPI fast path -- the exact silicon-validated configuration
     * from v2n-gd32-bridge-ping (see that example's main.c for the full
     * clocking + DMA rationale).  i2c stays NULL: BRD_I2C has its own
     * HIL rows and must not stall this soak. */
    alp_spi_t *spi = alp_spi_open(&(alp_spi_config_t){
        .bus_id        = 1u,
        .freq_hz       = 25000000u,
        .mode          = ALP_SPI_MODE_0,
        .bits_per_word = 8u,
        .cs_pin_id     = 0u, /* studio-resolved */
    });
    if (spi == NULL) {
        printf("[hil-soak] alp_spi_open failed: err=%d -- cannot soak\n",
               (int)alp_last_error());
        return 1;
    }

    link_init_blocking(spi);

    /* One-shot probes that must NOT loop: the DSP chain pool holds 4
     * chains and has no close opcode yet, so a per-cycle open would
     * exhaust it by cycle 5 and poison the stats.  Probe once, log,
     * move on -- full chain coverage belongs to the wave-2 DSP work. */
    {
        uint8_t chain_id = 0xFF;
        const alp_status_t s = gd32g553_adc_dsp_chain_open(&ctx, &chain_id);
        printf("[hil-soak] one-shot adc_dsp_chain_open -> %d (chain %u)\n",
               (int)s, chain_id);
    }

    /* ---- the soak proper ---- */
    uint32_t cycle = 0;
    uint32_t consecutive_ping_fails = 0;

    for (;;) {
        ++cycle;
        unsigned cycle_pass = 0, cycle_fail = 0;
        bool ping_ok_this_cycle = true;

        for (unsigned i = 0; i < SOAK_TEST_COUNT; ++i) {
            if (tests[i].fn(&tests[i].stat)) {
                ++tests[i].stat.pass;
                ++cycle_pass;
            } else {
                ++tests[i].stat.fail;
                ++cycle_fail;
                if (i == 0u) ping_ok_this_cycle = false;   /* tests[0] = ping */
            }
        }

        printf("[hil-soak] cycle %u | %u/%u PASS%s\n",
               cycle, cycle_pass, (unsigned)SOAK_TEST_COUNT,
               (cycle_fail != 0u) ? " <-- FAILURES THIS CYCLE" : "");

        /* Cumulative table every 16 cycles -- greppable soak verdict.
         * "SOAK-CLEAN" appears iff every test has zero failures. */
        if ((cycle % 16u) == 0u) {
            bool clean = true;
            printf("[hil-soak] ---- cumulative after %u cycles ----\n", cycle);
            for (unsigned i = 0; i < SOAK_TEST_COUNT; ++i) {
                const soak_stat_t *st = &tests[i].stat;
                if (st->fail != 0u) clean = false;
                printf("[hil-soak]   %-18s pass=%u fail=%u%s\n",
                       st->name, st->pass, st->fail,
                       st->fail ? " <--" : "");
            }
            printf("[hil-soak] verdict: %s\n", clean ? "SOAK-CLEAN" : "SOAK-DIRTY");
        }

        /* Link-level recovery: PING failing two cycles in a row means
         * the transport (not an opcode) is wedged -- re-run the
         * blocking init, which re-PINGs until the GD32 answers.  A
         * single failed cycle rides on the driver's own per-call
         * CRC/retry handling and just counts. */
        if (!ping_ok_this_cycle) {
            if (++consecutive_ping_fails >= 2u) {
                printf("[hil-soak] transport wedged -- re-initialising the link\n");
                link_init_blocking(spi);
                consecutive_ping_fails = 0;
            }
        } else {
            consecutive_ping_fails = 0;
        }

        k_msleep(1000);
    }

    /* not reached */
    return 0;
}
